package block6;

public class StringChanger {
    public static void main(String[] args) {
        String text = "Я дуже люблю свій дім. Мені в ньому дуже затишно і спокійно. У ньому живе моя найулюбленіша, рідна і дружна сім’я.\n" +
                "\n" +
                "Що значить для мене вираз «мій дім»? Це не просто стіни навколо мене, стеля над моєю головою і підлога під моїми ногами. Ні, це не найголовніше. Найголовніше для мене – це та атмосфера, в якій ми живемо.\n" +
                "\n" +
                "Ми живемо в невеликій трьох кімнатній квартирі, де є дві спальні. Одна з яких належить мені, а друга батькам. Є зал, в якому ми збираємося вечорами або у вихідні дні всією сім’єю розмовляємо і обговорюємо цікаві теми, дивимося телевізор. Так само в залі ми приймаємо гостей.\n" +
                "\n" +
                "Улюблена мамине місце в нашому домі – це кухня. Основний час після роботи мама приділяє кухні. Моя мама дуже любить готувати і піч, тому кухня – це її.\n" +
                "\n" +
                "Так само мама у нас відповідає за порядок в домі. Але ми з татом намагаємося їй допомагати, чим можемо. Адже прийшовши з роботи, додому мамі треба приготувати поїсти, попрати. Приділити увагу кожному з нас, якщо мені, щось не зрозуміло з уроків вона намагається мені допомогти.\n" +
                "\n" +
                "Улюблена мамине захоплення вирощувати квіти, тому у нас на підвіконнях в кожній кімнаті стоїть безліч красивих квітів. Це, наприклад, такі як кактуси, герань, фіалки, бегонія, фуксія і багато інших.\n" +
                "\n" +
                "Так само у нас росте алое або як мама його називає – столітник. Якщо хтось із нас поранить, то перший помічник – це алое. У залі на столі стоїть ваза з улюбленими маминими квітами – хризантемами.\n" +
                "\n" +
                "Тато в мене займається меблями, тому майже всі меблі в нашому домі зроблені татовими руками. Коли людина потрапляє до нас в гості перший раз, він протягом довгого часу розглядає, милуючись творінням батькових рук. Це красиві шафи, різьблений стіл і стільці. Папа намагається передати своє ремесло і мені. Коли у нас в домі, щось ламається, тато ремонтує, а я йому допомагаю.\n" +
                "\n" +
                "Сама кімната у мене. На стінах блакитні шпалери, стеля нагадує небо. На вікнах блакитні штори. З одного боку кімнати стоїть дуже красивий письмовий стіл з місцем під комп’ютер і доповнює його дуже красивий і зручний різьблений стілець. Все це тато зробив для мене своїми руками.\n" +
                "\n" +
                "У нас дуже затишний дім. Тут я відчуваю себе дуже вільно. Батьки для мене – це друзі. Я з ними ділюся всіма своїми радощами і прикрощами, вони мені завжди допоможуть і підкажуть, як треба робити. Я дуже люблю свій дім і своїх батьків. Завдяки тій атмосфері любові і затишку, які вони створили в нашому домі, я відчуваю себе щасливим.\n" +
                "\n" +
                "Варіант 2\n" +
                "Я дуже люблю свій дім, хоча це і квартира. Але, до речі, колись я хочу свій власний дім. Напевно, коли виросту, стану жити окремо від батьків. Але коли вони стануть зовсім немічними від старості, я їх, зрозуміло, заберу до себе в дім.\n" +
                "\n" +
                "Вони зможуть гуляти по саду, займатися квітами, повітрям свіжим дихати. А в тут квартиру піде мій виріс син, оскільки захоче самостійності. Він уже стане студентом.\n" +
                "\n" +
                "Так, а зараз наша квартира дуже простора – у кожного своя кімната. Тут ще й світло – великі вікна. Виходять вони на різні сторони – в місто, в парк. Живемо ми на п’ятому поверсі, сусіди хороші. Не так давно ми робили ремонт. Шпалери нові, так по дрібниці дещо. Але вдома стало ще світліше, приємніше.\n" +
                "\n" +
                "Мені подобається, що поруч з нашою квартирою ліс. Повітря у нас краще, ніж в центрі, навіть пташки співають. І немає проблем з паркуванням. У центрі вічно не знаєш, куди машину поставити.\n" +
                "\n" +
                "У нас вдома велика кухня, де ми всі можемо збиратися – їсти, дивитися телевізор, книги читати разом. Ще класно, що в коридорі батьки зробили гардеробну. Ціла кімнатка з полками, вішалками, коробками. І у кожного свій «відсік», щоб речі складати.\n" +
                "\n" +
                "У більшості випадків у нас вдома порядок. Кожні вихідні обов’язкове прибирання, в якій беруть участь всі. І у нас є посудомийна машина, яка дуже полегшила нам життя, а то вічно суперечки були, кому посуд мити. Точніше, у мами завжди манікюр, тато завжди зайнятий, а брат завжди «в той раз мив». Загалом, я дуже рада, що машинку купили.\n" +
                "\n" +
                "У нас на підвіконнях багато квітів, мама розводить. Я теж за ними доглядаю.\n" +
                "\n" +
                "У нас є кондиціонер, тому і в спеку у нас комфортно. І опалення від колонки, тому не топимо, коли тепло на вулиці, самі регулюємо температуру вдома. І у нас дуже затишно.\n" +
                "\n" +
                "Тільки брат іноді включає музику дуже голосно, але ми його лаємо. А так намагаємося навіть пральну машинку пізно або рано не включати, щоб сусідам не перешкодити.\n" +
                "\n" +
                "Ще у нас часто бувають гості, все теж люблять наш дім.";
        //так само як і в блоці 5
        System.out.println(text.replaceAll(" дім ", " будинок ").replaceAll(" дім.", " будинок."));
    }
}
